Elecrow-RD/CrowPanel-4.3-HMI-ESP32-Display-480x272/example/V2.1/ESP_IDF/LVGL_IDF/sdkconfig.defaults
# ESP-IDF 5.5.4 defaults for CrowPanel ESP32 4.3

CONFIG_IDF_TARGET="esp32s3"

# Arduino requires 1000 Hz tick rate
CONFIG_FREERTOS_HZ=1000

# Arduino as ESP-IDF component
CONFIG_ENABLE_ARDUINO_DEPENDS=y
CONFIG_ARDUINO_VARIANT="esp32s3"
# CONFIG_AUTOSTART_ARDUINO is not set

# LVGL uses lv_conf.h in components/lvgl-3/
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_FONT_MONTSERRAT_14=y

# Enable PSRAM (Quad mode for N4R2)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
# CONFIG_SPIRAM_MODE_OCT is not set
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# CPU frequency
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# CrowPanel 4.3 uses ESP32-S3-WROOM-1-N4R2: 4MB Quad Flash + 2MB Quad PSRAM
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_4mb.csv"

# app_main runs LVGL + RGB panel init; default 3584 stack is too small
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# N4R2 has Quad PSRAM, NOT Octal (OPI)
CONFIG_SPIRAM_MODE_QUAD=y
# CONFIG_SPIRAM_MODE_OCT is not set
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_USE_MALLOC=y
